## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

to load the spacex dataset.

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [ ]:
!pip install sqlalchemy==1.3.9

Requirement already satisfied: sqlalchemy==1.3.9 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (1.3.9)

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [ ]:
#Please uncomment and execute the code below if you are working locally.

#!pip install ipython-sql

In [ ]:
%load_ext sql

In [ ]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [ ]:
!pip install -q pandas==1.1.5

In [ ]:
%sql sqlite:///my_data1.db

'Connected: @my_data1.db'

In [ ]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

/home/jupyterlab/conda/envs/python/lib/python3.7/site-packages/pandas/core/generic.py:2615: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

**Note: This below code is added to remove blank rows from table**

In [8]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
(sqlite3.OperationalError) table SPACEXTABLE already exists
[SQL: create table SPACEXTABLE as select * from SPACEXTBL where Date is not null]
(Background on this error at: http://sqlalche.me/e/e3q8)

##### 1. Display the names of the unique launch sites  in the space mission

In [9]:
%sql select distinct(Launch_Site) from SPACEXTABLE

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

#####  2. Display 5 records where launch sites begin with the string 'CCA'

In [117]:
%sql select * from SPACEXTABLE where Launch_Site like "CCA%" limit 5

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

##### 3. Display the total payload mass carried by boosters launched by NASA (CRS)

In [21]:
%sql select sum(PAYLOAD_MASS__KG_) as "total(Customer=NASA(CRS))" from SPACEXTABLE where Customer="NASA (CRS)"

 * sqlite:///my_data1.db
Done.

[(45596,)]

##### 4. Display average payload mass carried by booster version F9 v1.1

In [20]:
%sql select avg(PAYLOAD_MASS__KG_) as "average(Booster_Version=F9 v1.1)" from SPACEXTABLE where Booster_Version="F9 v1.1"

 * sqlite:///my_data1.db
Done.

[(2928.4,)]

##### 5. List the date when the first succesful landing outcome in ground pad was acheived.

In [28]:
%sql select min(date) from SPACEXTBL where Landing_Outcome="Success (ground pad)"

 * sqlite:///my_data1.db
Done.

[('2015-12-22',)]


##### 6. List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [33]:
%sql select Booster_Version, Landing_Outcome, PAYLOAD_MASS__KG_ from SPACEXTBL where Landing_Outcome="Success (drone ship)" and PAYLOAD_MASS__KG_ between 4000 and 6000

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022', 'Success (drone ship)', 4696),
 ('F9 FT B1026', 'Success (drone ship)', 4600),
 ('F9 FT  B1021.2', 'Success (drone ship)', 5300),
 ('F9 FT  B1031.2', 'Success (drone ship)', 5200)]

##### 7. List the total number of successful and failure mission outcomes

In [37]:
%sql select count(*) as total,Landing_Outcome from SPACEXTBL group by Landing_Outcome

 * sqlite:///my_data1.db
Done.

[(5, 'Controlled (ocean)'),
 (3, 'Failure'),
 (5, 'Failure (drone ship)'),
 (2, 'Failure (parachute)'),
 (21, 'No attempt'),
 (1, 'No attempt '),
 (1, 'Precluded (drone ship)'),
 (38, 'Success'),
 (14, 'Success (drone ship)'),
 (9, 'Success (ground pad)'),
 (2, 'Uncontrolled (ocean)')]

In [54]:
%sql select count(*) as "total success" from SPACEXTBL where Landing_Outcome like "Success%"

 * sqlite:///my_data1.db
Done.

[(61,)]

In [55]:
%sql select count(*) as "total failure" from SPACEXTBL where Landing_Outcome like "Failure%"

 * sqlite:///my_data1.db
Done.

[(10,)]

##### 8. List the   names of the booster_versions which have carried the maximum payload mass. Using a subquery

In [69]:
%sql select Booster_Version, PAYLOAD_MASS__KG_ as "max payload mass" from SPACEXTBL where PAYLOAD_MASS__KG_ in (select max(PAYLOAD_MASS__KG_) from SPACEXTBL)

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4', 15600),
 ('F9 B5 B1049.4', 15600),
 ('F9 B5 B1051.3', 15600),
 ('F9 B5 B1056.4', 15600),
 ('F9 B5 B1048.5', 15600),
 ('F9 B5 B1051.4', 15600),
 ('F9 B5 B1049.5', 15600),
 ('F9 B5 B1060.2 ', 15600),
 ('F9 B5 B1058.3 ', 15600),
 ('F9 B5 B1051.6', 15600),
 ('F9 B5 B1060.3', 15600),
 ('F9 B5 B1049.7 ', 15600)]

##### 9. List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

In [79]:
%sql select substr(Date, 6,2) as month, Landing_Outcome,Booster_Version, Launch_Site from SPACEXTBL where substr(Date, 0,5)="2015" and Landing_Outcome="Failure (drone ship)"

 * sqlite:///my_data1.db
Done.

[('01', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('04', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

##### 10. Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [116]:
%sql select date, count(Landing_Outcome) as count, Landing_Outcome from SPACEXTBL where date between '2010/06/04' and '2017/03/20' group by Landing_Outcome order by count(Landing_Outcome) desc

 * sqlite:///my_data1.db
Done.

[('2016-04-08', 12, 'Success (drone ship)'),
 ('2012-05-22', 12, 'No attempt'),
 ('2015-12-22', 8, 'Success (ground pad)'),
 ('2015-01-10', 5, 'Failure (drone ship)'),
 ('2014-04-18', 4, 'Controlled (ocean)'),
 ('2013-09-29', 2, 'Uncontrolled (ocean)'),
 ('2015-06-28', 1, 'Precluded (drone ship)')]